[M_Ep8_SanctuaryTakesOff MissionDefinition]
MissionDescription="You grabbed an experimental power core from [place]Tundra Express[-place]. Given that such a core could keep [place]Sanctuary's[-place] defense shield powered indefinitely, Roland requested you bring it back to Lt. Davis. Give him a hand installing it, will you?"
TurnInDescription="[place]Sanctuary[-place] has disappeared.<br><br>Crap."

[M_Ep8_SanctuaryTakesOff:FindRolandSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Jack manipulated you. The Angel betrayed you. Welcome to Pandora. The ''power core'' you retrieved from [place]Tundra Express[-place] was actually a Hyperion adapter that allowed Angel to remotely shut down [place]Sanctuary's[-place] shields. The city is currently undergoing a hellish lunar bombardment. With [place]Sanctuary's[-place] engines relatively repaired, Lilith says she needs some Eridium to help facilitate [place]Sanctuary's[-place] escape. Roland has some -- you need to get it from him."

[M_Ep8_SanctuaryTakesOff:GoToCenterofTownSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Jack manipulated you. The Angel betrayed you. Welcome to Pandora. The ''power core'' you retrieved from [place]Tundra Express[-place] was actually a Hyperion adapter that allowed Angel to remotely shut down [place]Sanctuary's[-place] shields. The city is currently undergoing a hellish lunar bombardment. With [place]Sanctuary's[-place] engines relatively repaired, Lilith says she needs some Eridium to help facilitate [place]Sanctuary's[-place] escape."

[M_Ep8_SanctuaryTakesOff:GoToFridgeEntranceSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The city of [place]Sanctuary[-place] has (A) flown into the air, and (B) disappeared from this plane of existence. The Guardian Angel, the same AI who betrayed you and [place]Sanctuary[-place] in the first place, is now your only hope of returning to your friends. Which is kind of awkward She has asked you to head to [place]The Fridge[-place], a subterranean frozen wasteland crawling with tunnel rats."

[M_Ep8_SanctuaryTakesOff:GoToPylonSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Jack manipulated you. The Angel betrayed you. Welcome to Pandora. The ''power core'' you retrieved from [place]Tundra Express[-place] was actually a Hyperion adapter that allowed Angel to remotely shut down [place]Sanctuary's[-place] shields. The city is currently undergoing a hellish lunar bombardment. Roland has demanded that you and Scooter find a way to get [place]Sanctuary's[-place] engines running again -- specifically, by cycling the ignition primers in the middle of the city."

[M_Ep8_SanctuaryTakesOff:LeaveSanctuarySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The city of [place]Sanctuary[-place] has A) flown into the air, and B) disappeared from this plane of existence. The Guardian Angel, the same AI who betrayed you and [place]Sanctuary[-place] in the first place, is now your only hope of returning to your friends. Which is kind of awkward She has asked you to head to [place]The Fridge[-place], a subterranean frozen wasteland crawling with tunnel rats."

[M_Ep8_SanctuaryTakesOff:StartPylon1 MissionObjectiveDefinition]
ProgressMessage="Cycle third ignition primer"

[M_Ep8_SanctuaryTakesOff:StartPylon2 MissionObjectiveDefinition]
ProgressMessage="Cycle first ignition primer"

[M_Ep8_SanctuaryTakesOff:StartPylon3 MissionObjectiveDefinition]
ProgressMessage="Cycle third ignition primer"
